app/views/recipes/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = $1  [["recipe_id", 1]]
---
<ul class="list-group">
  <% @recipe.comments.each do |comment| %>