app/views/users/show.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 1]]
---
        <ul class="list-group">
          <% @user.recipes.each do |recipe| %>