app/controllers/comments_controller.rb

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Here's a comment"], ["user_id", 1], ["recipe_id", 1], ["created_at", 2016-08-09 10:55:45 UTC], ["updated_at", 2016-08-09 10:55:45 UTC]]
---
  def create
    @comment = current_user.comments.new(comment_params)
    @recipe = Recipe.find(comment_params[:recipe_id])

    respond_to do |format|
      if @comment.save