app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
  def index
    @recipes = Recipe.all

INSERT INTO "recipes" ("name", "image", "ingredients", "method", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "yytfty"], ["image", ""], ["ingredients", "chcjhjhjkjk"], ["method", "chgjhkjbkjbkjkjk"], ["user_id", 1], ["created_at", 2016-08-08 12:35:48 UTC], ["updated_at", 2016-08-08 12:35:48 UTC]]
---
  def create
    @recipe = current_user.recipes.new(recipe_params)

    respond_to do |format|
      if @recipe.save

UPDATE "recipes" SET "name" = $1, "image" = $2, "ingredients" = $3, "updated_at" = $4 WHERE "recipes"."id" = $5  [["name", "Kadai Gosht"], ["image", "Kadai-Gosht.jpg"], ["ingredients", "Chicken\r\nSauce"], ["updated_at", 2016-08-08 14:05:31 UTC], ["id", 2]]
---
  def update
    respond_to do |format|
      if @recipe.update(recipe_params)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_recipe
      @recipe = Recipe.find(params[:id])